Repository: omegat-fi/B333-OmegaT
Catalog: source/OmegaT-käännösmuisti-472646.tmx
Source language: en
Languages: fi

source: In the Search window, you can use standard shortcuts (Ctrl+N, Ctrl+P) to move from one segment to another.
fi: Hakuikkunassa voit käyttää vakiopikanäppäimiä (Ctrl + N, Ctrl + P) siirtyäksesi segmentistä toiseen.

source: • A search may be limited to 1000 items, so if you search on a common phrase, the editor then shows only those 1000 matching entries, and not all entries that match the search criteria.
fi: • Haun voi rajata 1000:een merkintään, joten jos haet tavallisella lausekkeella, editori näyttää vain ne 1000 täsmäävää merkintää, ei kaikkia merkintöjä, jotka vastaavat hakuehtoja.

source: The tags in OmegaT are greyed, so they are easy to recognise.
fi: OmegaT:ssä tunnisteet ovat harmaita, joten ne on helppo tunnistaa.

source: Translation memories in OmegaT ..........................................................................
fi: OmegaT:n käännösmuistit

source: Translation project files ..........................................................................................
fi: Käännösprojektitiedostot

source: • A file might have no matching entries, so it will show empty.
fi: • Tiedostossa ei välttämättä ole yhtään täsmäävää merkintää, jolloin se näkyy tyhjänä.

source: Source segmentation ...................................................................................................
fi: Lähteen segmentointi

source: Check TMs to include the translation memories located in the tm folder in the search.
fi: Valitse Käännösmuistit sisällyttääksesi käännösmuistikansiossa sijaitsevan käännösmuistin hakuun.

source: • Space matches nbsp: when this option is checked, a space character put in search entry can match either a normal space character or a non-breacking space (\u00A) character.
fi: • Välilyönti vastaa sitovaa välilyöntiä: kun tämä vaihtoehto on valittuna, hakuun laitettu välilyönti voi vastata normaalia tai sitovaa välilyöntiä.

source: (level1, level2 and omegat
fi: (level1, level2 ja omegat

source: Chapter 16.
fi: Luku 16

source: Working with formatted text .......................................................................................
fi: Työskentely muotoillun tekstin kanssa

source: Search for segments containing all keywords you specified, in any order.
fi: Etsii segmenttejä, jotka sisältävät kaikki määrittelemäsi avainsanat missä hyvänsä järjestyksessä.

source: Changing segmentation settings may cause some already translated segments to be split or merged.
fi: Segmentointiasetusten muuttaminen voi aiheuttaa käännettyjen segmenttien jakamiseen ja yhdistämiseen.

source: translation memory files
fi: käännösmuistitiedostot

source: • Translated or untranslated: search in both translated and untranslated segments.
fi: • Käännetyistä tai kääntämättömistä: hakee käännetyistä ja kääntämättömistä segmenteistä.

source: In both exact and keyword searches, the wild card search characters '*' and '?' can be used.
fi: Sekä tarkassa ja avainsanahaussa voidaan käyttää jokerimerkkejä ”*” ja ”?”.

source: Select keyword search to search for any number of individual full words, in any order.
fi: Valitse haku avainsanoilla, kun haluat etsiä yksittäisiä kokonaisia sanoja missä hyvänsä järjestyksessä.

source: Select the method using the radio buttons.
fi: Valitse menetelmä valintanappien avulla.

source: After you have translated each segment, press Ctrl+U to move to the next untranslated segment (or Ctrl+Shift+U to move to the next translated segment).
fi: Kun olet kääntänyt jokaisen segmentin, paina Ctrl + u siirtyäksesi seuraavaan kääntämättömään segmenttiin (tai Ctrl + Vaihto siirtyäksesi seuraavaan käännettyyn segmenttiä).

source: Change the encoding of{j}your files to Unicode
fi: {j}Muuta tiedostojen koodaus Unicodeksi

source: • If a search removes duplicates, those duplicates will not be in the Editor.
fi: • Jos haku poistaa kaksoiskappaleet, ne eivät ole editorissa.
